import '../../model/activity_model.dart';

class DestinationCourses {
  String imageUrl;
  String description;
  List<Activity> activities;

  DestinationCourses({
    required this.imageUrl,
    required this.description,
    required this.activities,
  });
}

List<DestinationCourses> destinations = [
  DestinationCourses(
    imageUrl: 'assets/images/intro.jpeg',
    description: 'Короткий огляд всіх подальших семінарів та тренінгів з Принципу',
    activities: [ Activity(
      imageUrl: 'assets/images/intro.jpeg',
      name: 'Вступ',
      type: 'Розберемо ціль SJ universe і для чого це вже було створено, '
          'а також розберемо головну ідею Принципу і чому важливо його вивчати в житті',
    ),
    ],
  ),
  DestinationCourses(
      imageUrl: 'assets/images/first.jpeg',
      description: 'Семінар першого рівня, де викладені осносні 3 основні теми',
      activities: [
        Activity(
          imageUrl: 'assets/images/pc.jpeg',
          name: 'Cемінар першого рівня',
          type: 'Семінар першого рівня, де будемо обговорювати ціль життя, '
              'причини конфліктів та приклад досягнення успіху',
        ),
        Activity(
          imageUrl: 'assets/images/pc.jpeg',
          name: 'Принцип Творення',
          type: 'Цілі, до яких прагне людина, а також універсальні Принципи, '
              'через які можна розвиватися та досягати цілі швидше.',
        ),
        Activity(
          imageUrl: 'assets/images/rc.jpeg',
          name: 'Причини конфліктів',
          type: 'Причини конфліктів у взаємовідносинах, а також причини того, '
              'чому іноді важко долати себе та досягати цілі. '
              'Роздивимося та проаналізуємо різні ідеї',
        ),
        Activity(
          imageUrl: 'assets/images/pr.jpeg',
          name: 'Принцип Відновлення',
          type: 'Приклади досягнення цілі людьми. Що нам робити, щоб досягати результату. '
              'Історичний погляд на розвиток людини',
        ),
      ]
  ),
  DestinationCourses(
    imageUrl: 'assets/images/second_level_seminar.jpg',
    description: 'In this lecture we are talking about all course and new truth.',
    activities: [ Activity(
      imageUrl: 'assets/images/pc.jpeg',
      name: 'Принцип Творення',
      type: 'Поставимо цілі, а також обговоримо шлях духовного розвитку. '
          'Звідки брати енергію і мотивацію, коли нічого не хочеться. '
          'Чому людина має долю відповідальності за своє життя?',
    ), Activity(
      imageUrl: 'assets/images/pc.jpeg',
      name: 'Робота над цілями',
      type: 'Що потрібно для того, щоб виконувати свої цілі і не закидувати? '
          'Як будувати взаємовідносини з людьми, щоб це сприяло меті, '
          'а також що значить бути гарним лідером?',
    ), Activity(
      imageUrl: 'assets/images/pc.jpeg',
      name: 'Причина Конфліктів',
      type: 'Розглянемо з історичної точки зору, чому з\'явився '
          'конфлікт в людській душі і як це впливає на взаємовідносини. '
          'Які наслідки? Що саме заважає нам бути щасливими',
    ), Activity(
      imageUrl: 'assets/images/pc.jpeg',
      name: 'Рефлексія',
      type: 'Розглянемо, як себе аналізувати і як зрозуміти, чому важко вчитися, '
          'або довіряти людям. Як змінити себе та помічати, що мені заважає розвиватися',
    ), Activity(
      imageUrl: 'assets/images/pc.jpeg',
      name: 'Критичне мислення',
      type: 'Ідеї чато бувають нав\'язані рекламними роликами. Та чи всі сприяють розвитку? '
          'Розглянемо, як працювати над критичним мисленням. '
          'Ще важливіше, обговоримо, як не залишитися в старій епосі',
    ), Activity(
      imageUrl: 'assets/images/pc.jpeg',
      name: 'Людина Шімджон',
      type: 'Хто така людина Шімджон (або істинний лідер). Чи існувала колись така людина? '
          'Чи має вона з\'явитися знову? Як нам стати такими людьми і знайти своє призначення',
    ), Activity(
      imageUrl: 'assets/images/pc.jpeg',
      name: 'Розвиток з точки зору духовності',
      type: 'Що таке Небесна вдача? Як на нас впливають попередні покоління? '
          'Чому деяким людям щось дається легко, а комусь зовсім важко? '
          'Як же примножувати Небесну вдачу?',
    ), Activity(
      imageUrl: 'assets/images/pc.jpeg',
      name: 'Принцип Відновлення',
      type: 'Розвиток взаємовідносин. Як досягати цілі у команді. '
          'Як зробити так, щоб люди мені довіряли. '
          'Розглянемо також важливість людини, з якої ми можемо брати приклад',
    ), Activity(
      imageUrl: 'assets/images/pc.jpeg',
      name: 'Протистояння 2х світоглядів',
      type: 'Як протягом історії розвивалися 2 точки зору та до чого це призводило. '
          'Які наслідки комуністичної точки зору? Як ці ідеологія впливає на нас зараз',
    ), Activity(
      imageUrl: 'assets/images/pc.jpeg',
      name: 'Головний фактор розвитку історії',
      type: 'Будемо вивчати паралелі історії та як вона розвивалася. '
          'Головне питання - для чого? Куди вона прямує. '
          'А також обговроримо сучасну загальноствітову політику',
    ), Activity(
      imageUrl: 'assets/images/pc.jpeg',
      name: 'Особистість Шімджон в наш час',
      type: 'Ми розглянемо особистість шімджон і дії, які він спрямовував на досягнення цілей. '
          'Як не втратити свою молодість, а навпаки наповнити її моментами, '
          'якими сожна буде пишатися і які домоможуть в майбутньому',
    ), Activity(
      imageUrl: 'assets/images/pc.jpeg',
      name: 'Підсумки семінару та NWET',
      type: 'Підіб\'ємо всі підсумки, чому ми навчилися на цьому семінарі, а також обговоримо, '
          'якою має бути освіта майбутнього і як ми ц втілюємо в nwet.',
    ),
    ],
  ),
];